app/controllers/api/v1/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
  def index

    # all_apartments = Apartment.all
    # render json: all_apartments, each_serializer: ApartmentSerializer

    all_apartments = Apartment.all

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show

    # @apartment=Apartment.find(params[:id])
    # render json: @apartment, serializer: ApartmentSerializer

    @apartment=Apartment.find(params[:id])