app/controllers/apartments_controller.rb

INSERT INTO "apartments" ("title", "description", "price", "address", "bedrooms", "bathrooms", "sq_ft", "pets", "date_available", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create

    # @apartment = Apartment.new(new_apartment_params)
    # if @apartment.save
    # redirect_to root_path
    # else
    #   render :new

    @apartment = Apartment.new(new_apartment_params)

    if @apartment.save

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    if (current_user.role == 'admin')
    @apartment = Apartment.find(params[:id])

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 4]]
---
  def destroy
  @apartment = Apartment.find(params[:id])
  @apartment.destroy

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "apartments" SET "bedrooms" = $1, "updated_at" = $2 WHERE "apartments"."id" = $3  [["bedrooms", "3....or 4"], ["updated_at", "2018-03-07 23:11:57.104564"], ["id", 1]]
---
  def update
    @apartment = Apartment.find(params[:id])
    # if @apartment.update(params[:apartment].permit(:title, :description, :price, :address, :bedrooms, :bathrooms, :sq_ft, :pets, :date_available, :photo ))
    #   redirect_to @apartment
    # else
    #   render :edit
    # end

    # authorize @apartment



     if @apartment.update_attributes(new_apartment_params)